fun main(args: Array<String>) {
    println("Hello Kotlin!")
    println("Hello Kotlin!")
    print("Hello")
    println("Hello")

    //Комментарий
    /*Крутой комментарий*/

    /*Задание 1. Программа, выводящая предложение в консоль с помощью функций print и println.
    Напишите программу, которая с помощью функций print и println выводит несколько предложений о вас в консоль.
    Текст может содержать ответы на вопросы: как вас зовут, откуда вы, имеете ли какой-то опыт в IT — и любую другую
    информацию, которой вы захотите поделиться.

    Выведите текст в консоль с помощью функций print и println. (Консоль не всегда корректно отображает русский язык.
    Если столкнётесь с этой проблемой, попробуйте написать текст на английском языке).Воспользуйтесь несколькими
    вызовами функции print/println. Оставьте однострочный или блочный комментарий к вашему коду.
    Закомментируйте одну или несколько строк вашего кода (Для этого необходимо чтобы в вашем коде
    было несколько вызовов функций print/println. Запустите программу, чтобы проверить, что она работает.*/

    //Крутой код
    print("Дубельщиков Александр Александр. ")
    println("Аспирант ВШЭ.")
    println("БЛА в ROS летают верх дном...!")
    //print("Этого вы видить не должны")

}